In [4]:
import pandas as pd
import numpy as np
Data = pd.Series([1,np.NAN,4,5,np.NAN,6])
Data

0    1.0
1    NaN
2    4.0
3    5.0
4    NaN
5    6.0
dtype: float64

In [5]:
Data.dropna()

0    1.0
2    4.0
3    5.0
5    6.0
dtype: float64

In [12]:
data1 = pd.DataFrame([[5.,2.9,8.],[1.5,np.NAN,np.NAN],[np.NAN,np.NAN,np.NAN],[np.NAN,6.2,23.]])
data1

     0    1     2
0  5.0  2.9   8.0
1  1.5  NaN   NaN
2  NaN  NaN   NaN
3  NaN  6.2  23.0

In [14]:
data1.dropna()

     0    1    2
0  5.0  2.9  8.0

In [13]:
data1.dropna(how='all')

     0    1     2
0  5.0  2.9   8.0
1  1.5  NaN   NaN
3  NaN  6.2  23.0

# Column dropping

In [16]:
data1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
data1.dropna(axis=1, how='all')

     0    1     2
0  5.0  2.9   8.0
1  1.5  NaN   NaN
2  NaN  NaN   NaN
3  NaN  6.2  23.0

In [19]:
data1.dropna(thresh=1)

     0    1     2
0  5.0  2.9   8.0
1  1.5  NaN   NaN
3  NaN  6.2  23.0

In [20]:
data1.dropna(thresh=2)

     0    1     2
0  5.0  2.9   8.0
3  NaN  6.2  23.0